# -*- coding: utf-8 -*-

"""

1. 将数据库中的某些资源以脚本接口的方式公开

"""

# -------------------------------------------------------------------------


from mongoengine import *
from malwrdb_models import *


# -------------------------------------------------------------------------


def get_all_sample_tree(filter=None):
    """
        获取所有样本的树

        @return: list : 列表
    """
    pass


def get_sample_info(sample_id):
    """
        获取某样本的所有信息
    """
    pass


# -------------------------------------------------------------------------
# ENF OF FILE
# -------------------------------------------------------------------------
